{
  "backend/main.mo": "Main Motoko actor implementing a habit tracker backend with access-controlled CRUD operations for user profiles and habits, including check-in tracking, streak calculation, and default habit seeding.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features — swipe-left delete gesture on HabitCard and the useDeleteHabit mutation hook — to their respective source files and test IDs.",
  "frontend-file-summaries.txt": "A JSON-formatted catalogue of short summaries for every frontend source file, describing the purpose and key behaviors of each component, page, hook, and config file.",
  "frontend/index.css": "Tailwind CSS entry point defining OKLCH-based CSS custom properties for the full design token set (colors, radius, chart, sidebar) in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, mounting the React root div and loading the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Sets up TanStack Router with a root Layout route and two child routes: HabitsPage at '/' and SummaryPage at '/summary'.",
  "frontend/src/components/AuthGuard.tsx": "Wraps children with Internet Identity authentication checks, showing a loading spinner, a login prompt with LoginButton, or the protected content depending on auth state.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with Habits, Summary, and a disabled Settings tab, highlighting the active route with primary color and a dot indicator.",
  "frontend/src/components/CheckInButton.tsx": "Renders a 44px circular button that shows a green check when already checked in, a muted circle for past dates, or an interactive ring button for today that triggers the useCheckIn mutation.",
  "frontend/src/components/DateStrip.tsx": "Horizontally scrollable week strip (Mon–Sun) that highlights today with a border and the selected date with a filled primary background, emitting the chosen date via a callback.",
  "frontend/src/components/FAB.tsx": "Fixed circular floating action button positioned above the bottom nav that triggers an onClick callback to open the add-habit modal.",
  "frontend/src/components/HabitCard.tsx": "Renders a single habit card with check-in status, pastel styling, and a left-swipe-to-delete gesture that triggers the delete mutation with animation.",
  "frontend/src/components/HabitForm.tsx": "Form component for creating a new habit with name and optional description fields, submitting via the useAddHabit mutation.",
  "frontend/src/components/HabitFormModal.tsx": "Bottom-sheet modal wrapper around HabitForm for adding a new habit, closing on success or dismiss.",
  "frontend/src/components/HabitList.tsx": "Fetches and renders the list of HabitCard components for a selected date, seeding default habits if none exist and showing a loading spinner otherwise.",
  "frontend/src/components/Layout.tsx": "App shell with a sticky header (logo + login button), main content outlet with bottom padding, an optional footer, and a bottom navigation bar.",
  "frontend/src/components/LoginButton.tsx": "Button that handles Internet Identity login and logout, clearing the React Query cache on logout and retrying login if already authenticated.",
  "frontend/src/components/StreakDisplay.tsx": "Displays the current and longest check-in streaks for a habit using the useStreakCalculation hook.",
  "frontend/src/components/WeeklySummary.tsx": "Shows a weekly stats dashboard with total check-ins, completion rate, active habit count, and a per-habit progress breakdown using useWeeklySummary.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor via React Query, invalidating dependent queries whenever the actor (identity) changes.",
  "frontend/src/hooks/useDateCheckIn.ts": "Pure hook that checks whether any check-in timestamp in a list falls within the calendar day of a given target date.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context (login, logout, identity, status) via AuthClient, with a React context provider and hook for consuming it.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, adding, checking in, and deleting habits via the ICP actor, plus a hook that auto-seeds a default 'Stretch & Move' habit when the list is empty.",
  "frontend/src/hooks/useStreakCalculation.ts": "Pure hook that computes the current and longest consecutive daily check-in streaks from an array of nanosecond timestamps.",
  "frontend/src/hooks/useTodayCheckIn.ts": "Hook that returns a boolean indicating whether the last check-in timestamp falls within today's date range.",
  "frontend/src/hooks/useWeeklySummary.ts": "Hook that aggregates the past 7 days of check-ins across all habits, returning total check-ins, completion rate, and a per-habit breakdown.",
  "frontend/src/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light/dark themes, pastel card colors, and utility classes for shadows and safe-area padding.",
  "frontend/src/main.tsx": "React app entry point that wraps the app with TanStack QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/HabitsPage.tsx": "Main habits page that renders a date strip for day selection, a habit list filtered to the selected date, and a FAB that opens the add-habit modal, all wrapped in AuthGuard.",
  "frontend/src/pages/SummaryPage.tsx": "Summary page that displays the WeeklySummary component inside an AuthGuard with a heading and description.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both regular and hash-based routes, persisting them to sessionStorage, and removing sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH color tokens, custom font sizes, Inter font family, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking existing features (swipe-to-delete HabitCard, useDeleteHabit hook) and pending feature requests (backend deleteHabit function) for the Habit Tracker app."
}