{
  "backend/main.mo": "Main Motoko actor defining Habit/HabitView types, CRUD operations (addHabit, checkIn, getHabits, getHabit), sorting utilities, and initial dummy habit seeding, with migration support.",
  "backend/migration.mo": "Motoko migration module that maps old actor state to new actor state, preserving habits and nextHabitId with a no-op habit transformation.",
  "feature_evidence.json": "Feature evidence report linking the HabitList empty-state UI update feature to its affected file and test requirement REQ-2.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary document describing the purpose of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens including backgrounds, borders, charts, and sidebar.",
  "frontend/index.html": "Minimal HTML shell for the Habit Tracker SPA, mounting the React app at #root and loading the main TSX entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with a root Layout route and two child routes: HabitsPage at / and SummaryPage at /summary.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with Habits, Summary, and disabled Settings tabs, highlighting the active route with primary color styling.",
  "frontend/src/components/CheckInButton.tsx": "Compact 44px circular button that shows a checkmark image when checked in, a muted circle for past dates, and an interactive ring button for today with a loading spinner.",
  "frontend/src/components/DateStrip.tsx": "Horizontally scrollable week strip (Mon–Sun) with circular day buttons that highlight today with a border and the selected date with a filled primary background.",
  "frontend/src/components/FAB.tsx": "Circular floating action button fixed bottom-left above the bottom nav, triggering an onClick callback to open the add-habit modal.",
  "frontend/src/components/HabitCard.tsx": "Full-width habit card with cycling pastel background, emoji icon, habit name/description, check-in count, and a CheckInButton, with strikethrough styling when checked in.",
  "frontend/src/components/HabitForm.tsx": "Controlled form for creating a new habit with name and optional description inputs, calling useAddHabit on submit and invoking an optional onSuccess callback.",
  "frontend/src/components/HabitFormModal.tsx": "A bottom-sheet modal component that wraps HabitForm for creating a new habit, closing the sheet on success or dismiss.",
  "frontend/src/components/HabitList.tsx": "Renders a list of HabitCard components for a selected date, auto-seeding placeholder habits if none exist, with loading and empty states.",
  "frontend/src/components/Layout.tsx": "Main app layout with a sticky header, bottom navigation, optional footer, and a router Outlet for page content.",
  "frontend/src/components/StreakDisplay.tsx": "Displays the current and longest check-in streaks for a habit using the useStreakCalculation hook.",
  "frontend/src/components/WeeklySummary.tsx": "Shows a weekly stats dashboard with total check-ins, completion rate, active habit count, and a per-habit breakdown with progress bars.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useDateCheckIn.ts": "Returns a boolean indicating whether any check-in timestamp falls within a given target date's day boundaries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout, identity state, and status flags via a React context and AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching habits, adding a habit, checking in, and seeding placeholder habits via the ICP backend actor.",
  "frontend/src/hooks/useStreakCalculation.ts": "Calculates the current and longest consecutive daily check-in streaks from an array of nanosecond timestamps.",
  "frontend/src/hooks/useTodayCheckIn.ts": "Returns a boolean indicating whether the last check-in timestamp falls within today's date range.",
  "frontend/src/hooks/useWeeklySummary.ts": "Computes weekly stats (total check-ins, completion rate, per-habit unique-day counts) for the past 7 days from a list of habits.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light/dark themes, including pastel colors and utility classes for shadows and safe-area padding.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HabitsPage.tsx": "Main habits page component that renders a date strip for navigation, a habit list for the selected date, and a FAB that opens a modal for adding new habits.",
  "frontend/src/pages/SummaryPage.tsx": "Summary page that displays the WeeklySummary component showing the user's habit progress over the past 7 days.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH color tokens, custom font sizes, Inter font family, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata file tracking version, existing features, and pending feature requests—specifically adding placeholder/demo habits pre-populated in the backend canister on initialization."
}