{
  "backend/main.mo": "Motoko actor implementing a habit tracker backend with user profiles, habit CRUD, check-ins, and role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering pages, components, hooks, and config files for the habit tracker app.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, charts, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML shell for the Habit Tracker SPA, mounting the React app at #root and loading the Vite entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with a root Layout route and two child routes: '/' for HabitsPage and '/summary' for SummaryPage.",
  "frontend/src/components/AuthGuard.tsx": "Wraps children with authentication checks using Internet Identity, showing a loading spinner, a login prompt, or the protected content depending on auth state.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with Habits, Summary, and disabled Settings tabs, highlighting the active route with primary color styling.",
  "frontend/src/components/CheckInButton.tsx": "Circular 44px button that shows a green check when done, a muted circle for past dates, or an interactive ring with spinner for today's check-in action.",
  "frontend/src/components/DateStrip.tsx": "Horizontally scrollable week strip (Mon–Sun) with circular day buttons that highlight today with a border and the selected date with a filled primary background.",
  "frontend/src/components/FAB.tsx": "Floating action button fixed bottom-left above the bottom nav, triggering an onClick callback to open the add-habit modal.",
  "frontend/src/components/HabitCard.tsx": "Pastel habit card with emoji icon, name, description, check-in count, and a CheckInButton; supports swipe-left gesture to trigger deletion with a red delete zone reveal.",
  "frontend/src/components/HabitForm.tsx": "A form component for creating new habits with name and description fields, using the useAddHabit mutation hook and showing a loading spinner during submission.",
  "frontend/src/components/HabitFormModal.tsx": "A bottom-sheet modal wrapper around HabitForm that slides up from the bottom of the screen for adding new habits.",
  "frontend/src/components/HabitList.tsx": "Renders a list of HabitCard components for the selected date, and automatically seeds a default 'Stretch & Move' habit if the user has none.",
  "frontend/src/components/Layout.tsx": "App shell component with a sticky header (logo + login button), main content outlet, optional footer, and bottom navigation bar.",
  "frontend/src/components/LoginButton.tsx": "A button that handles Internet Identity login and logout, showing appropriate icons and a loading spinner during the login process.",
  "frontend/src/components/StreakDisplay.tsx": "Displays the current and longest check-in streaks for a habit using the useStreakCalculation hook, with a badge icon.",
  "frontend/src/components/WeeklySummary.tsx": "Shows a weekly stats dashboard with total check-ins, completion rate, active habit count, and a per-habit progress breakdown for the past 7 days.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useDateCheckIn.ts": "A utility hook that checks whether any check-in timestamp in a list falls within a given calendar day.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functions, identity state, and status flags, backed by DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching habits, adding habits, checking in, deleting habits, and auto-seeding a default habit when the user's list is empty.",
  "frontend/src/hooks/useStreakCalculation.ts": "Custom hook that calculates the current and longest check-in streaks from an array of nanosecond timestamps, deduplicating same-day entries.",
  "frontend/src/hooks/useTodayCheckIn.ts": "Custom hook that returns a boolean indicating whether the last check-in in the provided array occurred today.",
  "frontend/src/hooks/useWeeklySummary.ts": "Custom hook that computes weekly check-in statistics per habit, including total check-ins, completion rate, and per-habit breakdowns over the past 7 days.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind directives, defines CSS custom properties for light/dark theme colors using OKLCH, and adds utility classes for pastel backgrounds and shadows.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/HabitsPage.tsx": "Page component rendering a date strip, habit list for the selected date, and a FAB that opens a habit creation modal, all wrapped in an AuthGuard.",
  "frontend/src/pages/SummaryPage.tsx": "Page component that displays the WeeklySummary component inside an AuthGuard with a heading and description.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, typography scale, font family, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata file tracking the current feature request to remove transparency from green check mark circles in the CheckInButton component."
}