{
  "backend/main.mo": "Motoko actor implementing the habit tracker backend with user profile management, habit CRUD operations, and check-in functionality, all gated behind access control/authorization checks.",
  "feature_evidence.json": "Feature evidence report linking the habits data-fetching fix (in useQueries.ts) to test requirement REQ-1 with high confidence.",
  "frontend-file-summaries.txt": "JSON map of short descriptions for every frontend source file, serving as a quick reference for the purpose and behavior of each component, page, and hook.",
  "frontend/index.css": "Tailwind entry stylesheet defining OKLCH-based CSS custom properties for the full design token set (colors, radius, chart, sidebar) in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, mounting the React tree into a #root div and loading the main.tsx entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with a root Layout route and two child routes: / (HabitsPage) and /summary (SummaryPage).",
  "frontend/src/components/AuthGuard.tsx": "Wraps children with an authentication check via useInternetIdentity, showing a loading spinner, a login prompt with LoginButton, or the protected content depending on auth state.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with Habits, Summary, and disabled Settings tabs, highlighting the active route with primary color and a dot indicator.",
  "frontend/src/components/CheckInButton.tsx": "Circular 44px button that renders a green check for completed check-ins, a muted circle for past dates, or an interactive ring button (with spinner) for today's check-in via the useCheckIn mutation.",
  "frontend/src/components/DateStrip.tsx": "Horizontally scrollable week strip (Mon–Sun) that highlights today with a border and the selected date with a filled primary background, emitting the chosen date via onSelectDate.",
  "frontend/src/components/FAB.tsx": "Fixed circular floating action button positioned above the bottom nav that triggers an onClick callback to open the add-habit modal.",
  "frontend/src/components/HabitCard.tsx": "Renders a single habit card with check-in status, pastel styling, and a left-swipe-to-delete gesture that triggers the delete mutation with animation.",
  "frontend/src/components/HabitForm.tsx": "Form component for creating a new habit with name and optional description fields, using the useAddHabit mutation on submit.",
  "frontend/src/components/HabitFormModal.tsx": "Bottom-sheet modal wrapper around HabitForm for adding a new habit, closing the sheet on success.",
  "frontend/src/components/HabitList.tsx": "Fetches and renders the list of HabitCard components for a selected date, seeding default habits if none exist and showing a loading spinner otherwise.",
  "frontend/src/components/Layout.tsx": "App shell with a sticky header (logo + login button), main content outlet with bottom padding, an optional footer, and a bottom navigation bar.",
  "frontend/src/components/LoginButton.tsx": "Button that handles Internet Identity login and logout, clearing the React Query cache on logout and retrying login if already authenticated.",
  "frontend/src/components/StreakDisplay.tsx": "Displays the current and longest check-in streaks for a habit using the useStreakCalculation hook.",
  "frontend/src/components/WeeklySummary.tsx": "Shows a weekly stats dashboard with total check-ins, completion rate, active habit count, and a per-habit progress breakdown using useWeeklySummary.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP actor via React Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useDateCheckIn.ts": "Utility hook that checks whether any check-in timestamp in a list falls within a given calendar day.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context (login, logout, identity, status) via AuthClient, with a React context provider and consumer hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, adding, checking in, and deleting habits via an ICP actor, plus a hook that auto-seeds a default 'Stretch & Move' habit when the user's habit list is empty.",
  "frontend/src/hooks/useStreakCalculation.ts": "Pure hook that computes the current and longest check-in streaks from an array of nanosecond timestamps, deduplicating same-day entries.",
  "frontend/src/hooks/useTodayCheckIn.ts": "Hook that returns a boolean indicating whether the last check-in timestamp falls within today's date range.",
  "frontend/src/hooks/useWeeklySummary.ts": "Hook that aggregates the past 7 days of check-ins across all habits, returning total check-ins, completion rate, and a per-habit breakdown.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind base/components/utilities, defines OKLCH CSS custom properties for light and dark themes, and adds pastel color and shadow utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/HabitsPage.tsx": "Page component rendering a date strip, habit list for the selected date, and a FAB that opens the add-habit modal, all wrapped in an AuthGuard.",
  "frontend/src/pages/SummaryPage.tsx": "Page component that displays the WeeklySummary component inside an AuthGuard with a heading and description.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both regular and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, font sizes, and OKLCH-based semantic color tokens (primary, success, pastel variants, etc.), with dark mode via class.",
  "project_state.json": "Project state metadata describing a habit tracker app with a known issue of habits not loading in the latest build and a registered fix feature request targeting useQueries.ts and HabitList.tsx."
}