{
  "backend/main.mo": "Motoko actor defining a habit tracker backend with CRUD operations for habits, check-in functionality, and query methods to retrieve habits sorted by name or check-in count.",
  "feature_evidence.json": "Feature evidence report documenting a completed feature to update the background color of a specific element in HabitsPage.tsx to light blue using Tailwind CSS.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing a React habit tracker app with professional typography, clean design system, and comprehensive habit tracking features.",
  "frontend/index.css": "Tailwind CSS base styles defining CSS custom properties for light and dark themes using OKLCH color space with muted tones and professional design tokens.",
  "frontend/index.html": "HTML entry point for the Habit Tracker application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for the habits page (/) and summary page (/summary), wrapped in a Layout component.",
  "frontend/src/components/CheckInButton.tsx": "Button component for checking in to a habit, displaying a checkmark icon and 'Done' state when already checked in, with loading state during mutation.",
  "frontend/src/components/HabitCard.tsx": "Card component displaying a single habit with title, description, check-in button, and streak display, with hover shadow effects.",
  "frontend/src/components/HabitForm.tsx": "Form component for creating new habits with name and optional description fields, using controlled inputs and mutation hook for submission.",
  "frontend/src/components/HabitList.tsx": "Component rendering a responsive grid of HabitCard components with loading spinner and empty state messaging when no habits exist.",
  "frontend/src/components/Layout.tsx": "Root layout component with sticky header containing logo and navigation links, main content outlet, and footer with caffeine.ai attribution.",
  "frontend/src/components/StreakDisplay.tsx": "Component displaying current and longest streak statistics with badge icon and amber-themed styling, calculated from check-in timestamps.",
  "frontend/src/components/WeeklySummary.tsx": "Displays a weekly summary dashboard with overall stats (total check-ins, completion rate, active habits) and per-habit breakdown using cards and progress bars. Fetches habits data and calculates weekly metrics using the useWeeklySummary hook.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Creates and manages AuthClient with configurable options and exposes authentication state (identity, login status, errors) to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for habit-related operations: useGetHabits fetches all habits, useAddHabit creates new habits, and useCheckIn records check-ins. All mutations invalidate the habits query cache on success.",
  "frontend/src/hooks/useStreakCalculation.ts": "Calculates current and longest streaks from an array of check-in timestamps by converting nanoseconds to dates, removing duplicates, and counting consecutive days.",
  "frontend/src/hooks/useTodayCheckIn.ts": "Determines if a habit has been checked in today by comparing the last check-in timestamp (converted from nanoseconds) against today's date range.",
  "frontend/src/hooks/useWeeklySummary.ts": "Computes weekly summary statistics from habits data including total check-ins, completion rate, and per-habit breakdown by filtering check-ins from the last 7 days and counting unique days.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, and utility classes for gradients, shadows, and text effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/HabitsPage.tsx": "Renders the main habits page with a header, HabitForm for adding new habits, and HabitList for displaying existing habits.",
  "frontend/src/pages/SummaryPage.tsx": "Renders the weekly summary page with a header and the WeeklySummary component showing progress statistics.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH-based color system, typography settings, border radius variables, shadows, and animation keyframes.",
  "project_state.json": "Project state file for a habit tracker application with light blue background. Contains one existing feature that updates a specific element's background color to light blue using Tailwind CSS."
}